In [1]:
import pandas as pd


#### Settings ###########
pd.set_option("max_colwidth", 1000)
pd.set_option("max_rows", 20)
pd.set_option("max_columns", 1000)
pd.set_option("precision", 2)
pd.options.display.float_format = "{:,.2f}".format

In [33]:
df = pd.read_csv('train_and_test2.csv' )
df.head()

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5,zero.6,Parch,zero.7,zero.8,zero.9,zero.10,zero.11,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
0,1,22.00,7.25,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,0,0,2.00,0,0,0
1,2,38.00,71.28,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0.00,0,0,1
2,3,26.00,7.92,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,0,0,2.00,0,0,1
3,4,35.00,53.10,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,2.00,0,0,1
4,5,35.00,8.05,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,0,0,2.00,0,0,0

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 28 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Passengerid  1309 non-null   int64
 1   Age          1309 non-null   float64
 2   Fare         1309 non-null   float64
 3   Sex          1309 non-null   int64
 4   sibsp        1309 non-null   int64
 5   zero         1309 non-null   int64
 6   zero.1       1309 non-null   int64
 7   zero.2       1309 non-null   int64
 8   zero.3       1309 non-null   int64
 9   zero.4       1309 non-null   int64
 10  zero.5       1309 non-null   int64
 11  zero.6       1309 non-null   int64
 12  Parch        1309 non-null   int64
 13  zero.7       1309 non-null   int64
 14  zero.8       1309 non-null   int64
 15  zero.9       1309 non-null   int64
 16  zero.10      1309 non-null   int64
 17  zero.11      1309 non-null   int64
 18  zero.12      1309 non-null   int64
 19  zero.13      1309 non-null   int64
 20  zero.14      1309 non-null   int64
 21  Pclass       1309 non-null   int64
 22  zero.15      1309 non-null   int64
 23  zero.16      1309 non-null   int64
 24  Embarked     1307 non-null   float64
 25  zero.17      1309 non-null   int64
 26  zero.18      1309 non-null   int64
 27  2urvived     1309 non-null   int64
dtypes: float64(3), int64(25)
memory usage: 286.5 KB

In [35]:
df.columns

Index(['Passengerid', 'Age', 'Fare', 'Sex', 'sibsp', 'zero', 'zero.1',
       'zero.2', 'zero.3', 'zero.4', 'zero.5', 'zero.6', 'Parch', 'zero.7',
       'zero.8', 'zero.9', 'zero.10', 'zero.11', 'zero.12', 'zero.13',
       'zero.14', 'Pclass', 'zero.15', 'zero.16', 'Embarked', 'zero.17',
       'zero.18', '2urvived'],
      dtype='object')

In [51]:
df = df[['Passengerid', 'Age', 'Fare', 'Sex', 'sibsp',  'Parch', 'Pclass',  'Embarked',  '2urvived']]

In [73]:
df.isnull().sum()

Passengerid    0
Age            0
Fare           0
Sex            0
sibsp          0
Parch          0
Pclass         0
Embarked       0
Survived       0
dtype: int64

In [52]:
df.head()

   Passengerid   Age  Fare  Sex  sibsp  Parch  Pclass  Embarked  2urvived
0            1 22.00  7.25    0      1      0       3      2.00         0
1            2 38.00 71.28    1      1      0       1      0.00         1
2            3 26.00  7.92    1      0      0       3      2.00         1
3            4 35.00 53.10    1      1      0       1      2.00         1
4            5 35.00  8.05    0      0      0       3      2.00         0

In [53]:
df['Survived'] = df['2urvived']
df.head()

<ipython-input-53-f4dd02175d8c>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Survived'] = df['2urvived']

,Passengerid,Age,Fare,Sex,sibsp,Parch,Pclass,Embarked,2urvived,Survived
0,1,22.00,7.25,0,1,0,3,2.00,0,0
1,2,38.00,71.28,1,1,0,1,0.00,1,1
2,3,26.00,7.92,1,0,0,3,2.00,1,1
3,4,35.00,53.10,1,1,0,1,2.00,1,1
4,5,35.00,8.05,0,0,0,3,2.00,0,0

In [56]:
df = df[['Passengerid', 'Age', 'Fare', 'Sex', 'sibsp',  'Parch', 'Pclass',  'Embarked',  'Survived']]
df.head()

   Passengerid   Age  Fare  Sex  sibsp  Parch  Pclass  Embarked  Survived
0            1 22.00  7.25    0      1      0       3      2.00         0
1            2 38.00 71.28    1      1      0       1      0.00         1
2            3 26.00  7.92    1      0      0       3      2.00         1
3            4 35.00 53.10    1      1      0       1      2.00         1
4            5 35.00  8.05    0      0      0       3      2.00         0

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Passengerid  1309 non-null   int64
 1   Age          1309 non-null   float64
 2   Fare         1309 non-null   float64
 3   Sex          1309 non-null   int64
 4   sibsp        1309 non-null   int64
 5   Parch        1309 non-null   int64
 6   Pclass       1309 non-null   int64
 7   Embarked     1307 non-null   float64
 8   Survived     1309 non-null   int64
dtypes: float64(3), int64(6)
memory usage: 92.2 KB

In [58]:
df.isnull().sum()

Passengerid    0
Age            0
Fare           0
Sex            0
sibsp          0
Parch          0
Pclass         0
Embarked       2
Survived       0
dtype: int64

In [59]:
df['Embarked'].describe()

count   1,307.00
mean        1.49
std         0.81
min         0.00
25%         1.00
50%         2.00
75%         2.00
max         2.00
Name: Embarked, dtype: float64

In [66]:
print(df['Embarked'].mode()[0])
print(df['Embarked'].median())
print(df['Embarked'].mean())

2.0
2.0
1.4927314460596786

In [74]:
df['Embarked'] = df['Embarked'].fillna(df['Embarked'].mode()[0])
df.isnull().sum()

Passengerid    0
Age            0
Fare           0
Sex            0
sibsp          0
Parch          0
Pclass         0
Embarked       0
Survived       0
dtype: int64

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Passengerid  1309 non-null   int64
 1   Age          1309 non-null   float64
 2   Fare         1309 non-null   float64
 3   Sex          1309 non-null   int64
 4   sibsp        1309 non-null   int64
 5   Parch        1309 non-null   int64
 6   Pclass       1309 non-null   int64
 7   Embarked     1309 non-null   float64
 8   Survived     1309 non-null   int64
dtypes: float64(3), int64(6)
memory usage: 92.2 KB

In [78]:
df.size

11781